EWSEditor/EwsPostExamples/GetSearchableMailboxes.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013" />
  </soap:Header>
  <soap:Body >
    <m:GetSearchableMailboxes>
      <m:SearchFilter>lolgroup</m:SearchFilter>
      <m:ExpandGroupMembership>false</m:ExpandGroupMembership>
    </m:GetSearchableMailboxes>
  </soap:Body>
</soap:Envelope>
